atc1441/ESP32_nRF52_SWD/ESP32_SWD_WIFI/web.cpp
                  if (nrf_ufcr.flash_size > (SPIFFS.totalBytes() - SPIFFS.usedBytes()))
                  {
                    request->send(200, "text/plain", "Not enough free space on the ESP32");
                    return;
                  }

                  String filename = "/full_flash.bin";
                  set_read_flash(0, nrf_ufcr.flash_size, filename);

                  request->send(200, "text/plain", "Ok create task full dump");
                }
                else if (new_state == "dump_full_uicr")
                {

                  if (get_glitcher())
                  {
                    request->send(200, "text/plain", "ERROR Glitcher is running");
                    return;
                  }
                  if (is_nrf_connected() == 0)
                  {
                    request->send(200, "text/plain", "ERROR nRF not connected");
                    return;
                  }
                  else if (is_nrf_connected() == 1)
                  {
                    request->send(200, "text/plain", "ERROR nRF is locked");
                    return;
                  }

                  if (0x1000 > (SPIFFS.totalBytes() - SPIFFS.usedBytes()))
                  {
                    request->send(200, "text/plain", "Not enough free space on the ESP32");
                    return;
                  }
                  String filename = "/full_uicr.bin";
                  set_read_flash(0x10001000, 0x1000, filename);

                  request->send(200, "text/plain", "Ok create UICR dump");
                }
                return;
              }
              request->send(200, "text/plain", "Wrong parameter");
            });

  server.on(
      "/flash_file_direct", HTTP_POST, [](AsyncWebServerRequest *request)
      { request->send(200, "text/plain", "Upload complete!"); },
      [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
      {
        Serial.printf("received data file:%s index:%d len:%d final:%d\r\n", filename.c_str(), index, len, final);

        uint32_t copy_len = 0;

        if (!index)
        {
          millis_start = millis();
          if (request->hasParam("flash_up_file_offset"), true)
          {
            _main_offset = hstol(request->getParam("flash_up_file_offset", true)->value());
          }
        }
        uint32_t already_copy_len = 0;
        while (len)
        {
          bool size_flag = (_direct_position + len) > 4096;
          copy_len = size_flag ? (4096 - _direct_position) : len;
          memcpy(&_direct_buffer[_direct_position], &data[already_copy_len], copy_len);
          len -= copy_len;
          already_copy_len += copy_len;
          _direct_position += copy_len;
          if (size_flag || final)
          {
            Serial.printf("Ok gonna flash bank final: %i, offset:%08x, len: %i len_left %i\r\n", final, _direct_offset + _main_offset, _direct_position, len);
            nrf_write_bank(_direct_offset + _main_offset, (uint32_t *)_direct_buffer, _direct_position);
            _direct_offset += _direct_position;
            _direct_position = 0;
          }
        }
        if (final)
        {
          set_last_speed((float)((float)(_direct_offset + copy_len) / (float)(millis() - millis_start)));
          _direct_offset = 0;
        }
      });

  server.on("/download_flash", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              nrf_info_struct nrf_ufcr;
              get_new_main_info(&nrf_ufcr);
              int download_len = nrf_ufcr.flash_size;

              static uint32_t offset = 0;

              if (request->hasParam("offset"))
              {
                offset = hstol(request->getParam("offset")->value());

                if (offset > nrf_ufcr.flash_size) {
                  request->send(400, "text/html", "ERROR: Invalid offset!"); 
                  return;
                }
              }

              if (request->hasParam("len"))
              {
                download_len = hstol(request->getParam("len")->value());
                if (offset + download_len > nrf_ufcr.flash_size) {
                  request->send(400, "text/html", "ERROR: Too big download length!"); 
                  return;
                }
              }

              if (offset + download_len > nrf_ufcr.flash_size) {
                download_len = nrf_ufcr.flash_size - offset;
              }

              Serial.printf("reading flash: offset:0x%X download_len:%d\n", offset, download_len);

              AsyncWebServerResponse *response = request->beginResponse("application/octet-stream", download_len, [](uint8_t *buffer, size_t maxLen, size_t index) -> size_t
                {
                  Serial.printf("handle download: index:0x%X maxLen:%d offset:0x%X\n", index, maxLen, offset);

                  if (maxLen > 0)
                  {
                    return nrf_read_bank_bytes(offset + index, buffer, maxLen);
                  }

                  return 0;
                });

              response->addHeader("Content-Disposition", "attachment; filename=\"flash.bin\"");
              request->send(response);
            });
            
  server.on("/get_graph", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              if (request->hasParam("size")&&request->hasParam("delay"))
              {
              uint32_t size = request->getParam("size")->value().toInt();
              uint32_t delay_time = request->getParam("delay")->value().toInt();
              uint16_t graph_buff[size] = {0};
              get_osci_graph(graph_buff, size,delay_time);
              String answer_state = "";
              for(int i =0;i<size;i++){
                answer_state += String(graph_buff[i]) + ",";
              }                
              answer_state += "0";
              request->send(200, "text/plain", answer_state);
            }});

  server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.htm");

